# Fonction cut

La fonction cut permet de créer une colonne selon certaines conditions à respecter, tout en évitant de recourir aux instructions if / elif / else

Date : 03/03/25 <br>
Editeur : Laurent Reynaud

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "Name": ['Marcus', 'Leia', 'Oscar', 'Dan', 'Judy', 'Tom', 'Emily'],
    "Score": [90, 95, 55, 62, 75, 98, 81]
    })
df

     Name  Score
0  Marcus     90
1    Leia     95
2   Oscar     55
3     Dan     62
4    Judy     75
5     Tom     98
6   Emily     81

1ère solution : recourir aux conditions if / elif / else

In [3]:
# Nouvelle colonne
df['grade'] = 'Undefined'
df

     Name  Score      grade
0  Marcus     90  Undefined
1    Leia     95  Undefined
2   Oscar     55  Undefined
3     Dan     62  Undefined
4    Judy     75  Undefined
5     Tom     98  Undefined
6   Emily     81  Undefined

In [4]:
# Recours aux conditions if...
for i, row in df.iterrows():
    if row['Score'] >= 90:
        df.loc[i, 'grade'] = 'A'
    elif row['Score'] >= 80:
        df.loc[i, 'grade'] = 'B'
    elif row['Score'] >= 70:
        df.loc[i, 'grade'] = 'C'
    elif row['Score'] >= 60:
        df.loc[i, 'grade'] = 'D'
    else:
        df.loc[i, 'grade'] = 'E'
df

     Name  Score grade
0  Marcus     90     A
1    Leia     95     A
2   Oscar     55     E
3     Dan     62     D
4    Judy     75     C
5     Tom     98     A
6   Emily     81     B

2ème solution : recourir à la fonction 'cut'

In [5]:
df_cut = pd.DataFrame({
    "Name": ['Marcus', 'Leia', 'Oscar', 'Dan', 'Judy', 'Tom', 'Emily'],
    "Score": [90, 95, 55, 62, 75, 98, 81]
    })

In [6]:
# Valeurs recherchée assignées dans une liste
bins = [0, 60, 70, 80, 90, 100]

In [7]:
# Valeurs attribuées assigénes dans une liste, 
# aux valeurs recherchées dans la liste ci-avant
labels = ['E', 'D', 'C', 'B', 'A']

In [8]:
# Recours à la fonction cut
df_cut['grade'] = pd.cut(
    df_cut['Score'], # Colonne ciblée
    bins=bins, # Valeurs recherchées dans la colonne 'score'
    labels=labels, # Valeurs attribuées dans la nouvelle colonne 'grade'
    right=False,
)
df_cut

     Name  Score grade
0  Marcus     90     A
1    Leia     95     A
2   Oscar     55     E
3     Dan     62     D
4    Judy     75     C
5     Tom     98     A
6   Emily     81     B